#+OPTIONS:    H:3 num:nil toc:2 \n:nil @:t ::t |:t ^:{} -:t f:t *:t TeX:t LaTeX:t skip:nil d:(HIDE) tags:not-in-toc
#+STARTUP:    align fold nodlcheck hidestars oddeven lognotestate hideblocks
#+SEQ_TODO:   TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+TAGS:       Write(w) Update(u) Fix(f) Check(c) noexport(n)
#+TITLE:      Org-babel-tcl
#+AUTHOR:     Luis Anaya
#+EMAIL:      papoanaya[at]hotmail[dot]com
#+LANGUAGE:   en
#+STYLE:      <style type="text/css">#outline-container-introduction{ clear:both; }</style>
#+LINK_UP:    ../languages.html
#+LINK_HOME:  http://orgmode.org/worg/

#+begin_html
  <div id="subtitle" style="float: center; text-align: center;">
  <p>
  Org-babel support for
  <a href="http://www.tcl.tk/">tclsh</a>
  </p>
  </p>
  </div>
#+end_html

** Named Procedures and Tables
The Babel Tcl plugin supports the use of named procedures, calls  and table
operations. The use of these are detailed in the /Org Manual/.  This
manual will describe how they are used within the context of a Tcl
program. 

A variable can be passed to a Tcl program which can be used to call the
aforementioned program later on in your org document.  The following
example is a program that just writes the value of the variable. 

#+begin_example
#+name: reflector(x=0)
#+begin_src tcl :results output
puts $x
#+end_src

#+RESULTS: reflector
: 0
#+end_example 

Pressing =C-c C-c= will result in the default value to be written. Calling
the named block later on with a different value will result on that
value been written in the =#RESULTS:= For example: 

#+begin_example
#+call: reflector(20)
#+RESULTS: reflector(20)
: 20
#+end_example

This is not constrained only to =:results output= headers. Procedures in
which the result is a =value= can also be used. For example: 

#+begin_example
#+name: square(x=0)
#+begin_src tcl :results value
return [expr $x * $x]
#+end_src

#+RESULTS: square
: 0
#+end_example

Executing it with C-c C-c with different values will result to that value being
returned. For example:

#+begin_example
#+call: square(x=2)

#+RESULTS: square(x=2)
: 4
#+end_example 

Sending Tcl code as part of the parameter is also supported. For
example: 

#+begin_example
#+call: square(x=[expr 2 + 10])

#+RESULTS: square(x=[expr 2 + 10])
: 144
#+end_example 

Table processing is supported in Tcl blocks. The resultant data
structure in  Tcl is a list of lists. For example: 


#+begin_example
#+tblname: testtbl
| 1 | 2 |
| 3 | 4 |

#+name: processtbl(x=0)
#+begin_src tcl :results output
puts $x
foreach y $x {
  puts [expr [lindex $y 0] * [lindex $y 1]]
}
#+end_src
#+end_example

The program prints the table as a list, add the first and second values and
writing the results. Calling this block later on in the Org document
will result in the following output.

#+begin_example
#+call: processtbl(x=testtbl)

#+RESULTS: processtbl(x=testtbl)
: {1  2}  {3  4}
: 2
: 12
#+end_example

